In [2]:
import os
from pymongo import MongoClient
import pandas as pd

In [20]:
MONGODB_USERNAME = os.environ.get("MONGODB_USERNAME")
MONGODB_PASSWORD = os.environ.get("MONGODB_PASSWORD")

CONNECTION_STRING = f"mongodb+srv://{MONGODB_USERNAME}:{MONGODB_PASSWORD}@cluster0.ofns0fq.mongodb.net/"

client = MongoClient(CONNECTION_STRING)

db = client["sample_analytics"]

collection = db["transactions"]

data = collection.find()

df = pd.DataFrame(data)

In [5]:
print(df.shape)
df.head()

(1746, 6)

,_id,account_id,transaction_count,bucket_start_date,bucket_end_date,transactions
0,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03,"[{'date': 2003-09-09 00:00:00, 'amount': 7514,..."
1,5ca4bbc1a2dd94ee58161cb2,716662,48,1962-05-13,2016-12-27,"[{'date': 2008-03-19 00:00:00, 'amount': 8592,..."
2,5ca4bbc1a2dd94ee58161cb3,557378,56,1990-06-11,2016-11-06,"[{'date': 2006-10-06 00:00:00, 'amount': 2561,..."
3,5ca4bbc1a2dd94ee58161cb4,278603,83,1975-06-02,2017-01-04,"[{'date': 2016-09-13 00:00:00, 'amount': 3425,..."
4,5ca4bbc1a2dd94ee58161cb5,674364,57,1973-06-13,2017-01-09,"[{'date': 2014-08-29 00:00:00, 'amount': 9592,..."

In [5]:
print(type(df['transactions'][0]))
df['transactions'][0][:3]

<class 'list'>

[{'date': datetime.datetime(2003, 9, 9, 0, 0),
  'amount': 7514,
  'transaction_code': 'buy',
  'symbol': 'adbe',
  'price': '19.1072802650074180519368383102118968963623046875',
  'total': '143572.1039112657392422534031'},
 {'date': datetime.datetime(2016, 6, 14, 0, 0),
  'amount': 9240,
  'transaction_code': 'buy',
  'symbol': 'team',
  'price': '24.1525632387771480580340721644461154937744140625',
  'total': '223169.6843263008480562348268'},
 {'date': datetime.datetime(2002, 12, 4, 0, 0),
  'amount': 2824,
  'transaction_code': 'buy',
  'symbol': 'msft',
  'price': '21.046193953245431629284212249331176280975341796875',
  'total': '59434.45172396509892109861539'}]

In [6]:
temp = pd.json_normalize(df.to_dict('records'), meta=['_id', 'account_id', 'transaction_count', 'bucket_start_date', 'bucket_end_date'], record_path='transactions')
temp.head()

,date,amount,transaction_code,symbol,price,total,_id,account_id,transaction_count,bucket_start_date,bucket_end_date
0,2003-09-09,7514,buy,adbe,19.1072802650074180519368383102118968963623046875,143572.1039112657392422534031,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03
1,2016-06-14,9240,buy,team,24.1525632387771480580340721644461154937744140625,223169.6843263008480562348268,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03
2,2002-12-04,2824,buy,msft,21.0461939532454316292842122493311762809753417...,59434.45172396509892109861539,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03
3,2014-07-14,7418,sell,sap,76.38514540536692720706923864781856536865234375,566625.0086170118660220396123,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03
4,2011-10-28,5638,buy,adbe,28.3656576086411753578886418836191296577453613...,159925.5775975189466677761629,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03

In [7]:
sorted_col = list(df.columns) + list(df['transactions'][0][0].keys())
final_df = temp.reindex(axis=1, labels=sorted_col).drop(columns=['transactions'])
final_df.head() # denormalized dataframe

,_id,account_id,transaction_count,bucket_start_date,bucket_end_date,date,amount,transaction_code,symbol,price,total
0,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03,2003-09-09,7514,buy,adbe,19.1072802650074180519368383102118968963623046875,143572.1039112657392422534031
1,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03,2016-06-14,9240,buy,team,24.1525632387771480580340721644461154937744140625,223169.6843263008480562348268
2,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03,2002-12-04,2824,buy,msft,21.0461939532454316292842122493311762809753417...,59434.45172396509892109861539
3,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03,2014-07-14,7418,sell,sap,76.38514540536692720706923864781856536865234375,566625.0086170118660220396123
4,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03,2011-10-28,5638,buy,adbe,28.3656576086411753578886418836191296577453613...,159925.5775975189466677761629

In [8]:
table_1 = final_df[['_id', 'account_id', 'transaction_count', 'bucket_start_date', 'bucket_end_date']]
table_1.head()

,_id,account_id,transaction_count,bucket_start_date,bucket_end_date
0,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03
1,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03
2,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03
3,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03
4,5ca4bbc1a2dd94ee58161cb1,443178,66,1969-02-04,2017-01-03

In [9]:
table_2 = final_df[['_id', 'date', 'amount', 'transaction_code', 'symbol', 'price', 'total']]
table_2.head()

,_id,date,amount,transaction_code,symbol,price,total
0,5ca4bbc1a2dd94ee58161cb1,2003-09-09,7514,buy,adbe,19.1072802650074180519368383102118968963623046875,143572.1039112657392422534031
1,5ca4bbc1a2dd94ee58161cb1,2016-06-14,9240,buy,team,24.1525632387771480580340721644461154937744140625,223169.6843263008480562348268
2,5ca4bbc1a2dd94ee58161cb1,2002-12-04,2824,buy,msft,21.0461939532454316292842122493311762809753417...,59434.45172396509892109861539
3,5ca4bbc1a2dd94ee58161cb1,2014-07-14,7418,sell,sap,76.38514540536692720706923864781856536865234375,566625.0086170118660220396123
4,5ca4bbc1a2dd94ee58161cb1,2011-10-28,5638,buy,adbe,28.3656576086411753578886418836191296577453613...,159925.5775975189466677761629

In [ ]:
text = "s\tHello World!s"
text = text.replace("", "____")
# len(text.strip())
print(text)

s	Hello World!____s